[
    {
      "id": "1",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/1aristotle_unhtxc.jpg",
      "title": "Aristotle and Dante Discover the Secrets of the Universe",
      "author": "Benjamin Alire Sáenz",
      "published": "2012-02-21",
      "publisher": "Penguin Books",
      "pages": 359,
      "description": "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship--the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be.",
      "reviews": ""
    },
    {
      "id": "2",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/2thecolorpurple_mjzt9w.jpg",
      "title": "The Color Purple",
      "author": "Alice Walker",
      "published": "2019-12-10",
      "publisher": "Penguin Books",
      "pages": 304,
      "description": "A powerful cultural touchstone of modern American literature, The Color Purple depicts the lives of African American women in early twentieth-century rural Georgia. Separated as girls, sisters Celie and Nettie sustain their loyalty to and hope in each other across time, distance and silence. Through a series of letters spanning twenty years, first from Celie to God, then the sisters to each other despite the unknown, the novel draws readers into its rich and memorable portrayals of Celie, Nettie, Shug Avery and Sofia and their experience. The Color Purple broke the silence around domestic and sexual abuse, narrating the lives of women through their pain and struggle, companionship and growth, resilience and bravery. Deeply compassionate and beautifully imagined, Alice Walker's epic carries readers on a spirit-affirming journey towards redemption and love.",
      "reviews": ""
    },
    {
      "id": "3",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/3picofdorian_l1hof8.jpg",
      "title": "The Picture of Dorian Gray",
      "author": "Oscare Wilde, Jeffrey Eugenides (Introduction)",
      "published": "2004-06-01",
      "publisher": "Modern Library Classics",
      "pages": 272,
      "description": "Written in his distinctively dazzling manner, Oscar Wilde’s story of a fashionable young man who sells his soul for eternal youth and beauty is the author’s most popular work. The tale of Dorian Gray’s moral disintegration caused a scandal when it ﬁrst appeared in 1890, but though Wilde was attacked for the novel’s corrupting inﬂuence, he responded that there is, in fact, “a terrible moral in Dorian Gray.” Just a few years later, the book and the aesthetic/moral dilemma it presented became issues in the trials occasioned by Wilde’s homosexual liaisons, which resulted in his imprisonment. Of Dorian Gray’s relationship to autobiography, Wilde noted in a letter, “Basil Hallward is what I think I am: Lord Henry what the world thinks me: Dorian what I would like to be—in other ages, perhaps.",
      "reviews": ""
    },
    {
      "id": "4",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/4middlesex_ddnvsl.jpg",
      "title": "Middlesex",
      "author": "Jeffrey Eugenides",
      "published": "2003-09-16",
      "publisher": "Picador USA",
      "pages": 529,
      "description": "Middlesex tells the breathtaking story of Calliope Stephanides, and three generations of the Greek-American Stephanides family, who travel from a tiny village overlooking Mount Olympus in Asia Minor to Prohibition-era Detroit, witnessing its glory days as the Motor City and the race riots of 1967 before moving out to the tree-lined streets of suburban Grosse Pointe, Michigan. To understand why Calliope is not like other girls, she has to uncover a guilty family secret, and the astonishing genetic history that turns Callie into Cal, one of the most audacious and wondrous narrators in contemporary fiction. Lyrical and thrilling, Middlesex is an exhilarating reinvention of the American epic.",
      "reviews": ""
    },
    {
      "id": "5",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/5maurice_u6apvb.jpg",
      "title": "Maurice",
      "author": "E.M. Forster",
      "published": "2005-12-17",
      "publisher": "W.W. Norton Company",
      "pages": 256,
      "description": "Maurice is heartbroken over unrequited love, which opened his heart and mind to his own sexual identity. In order to be true to himself, he goes against the grain of society’s often unspoken rules of class, wealth, and politics.\n\nForster understood that his homage to same-sex love, if published when he completed it in 1914, would probably end his career. Thus, Maurice languished in a drawer for fifty-seven years, the author requesting it be published only after his death (along with his stories about homosexuality later collected in The Life to Come).\n\nSince its release in 1971, Maurice has been widely read and praised. It has been, and continues to be, adapted for major stage productions, including the 1987 Oscar-nominated film adaptation starring Hugh Grant and James Wilby.",
      "reviews": ""
    },
    {
      "id": "6",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/6callmebyyourname_wsqqwq.jpg",
      "title": "Call Me By Your Name",
      "author": "André Aciman",
      "published": "2017-09-21",
      "publisher": "Atlantic Books",
      "pages": 248,
      "description": "Call Me by Your Name is the story of a sudden and powerful romance that blossoms between an adolescent boy and a summer guest at his parents' cliff-side mansion on the Italian Riviera. Unprepared for the consequences of their attraction, at first each feigns indifference. But during the restless summer weeks that follow, unrelenting buried currents of obsession and fear, fascination and desire, intensify their passion as they test the charged ground between them. What grows from the depths of their spirits is a romance of scarcely six weeks' duration and an experience that marks them for a lifetime. For what the two discover on the Riviera and during a sultry evening in Rome is the one thing both already fear they may never truly find again: total intimacy. The psychological maneuvers that accompany attraction have seldom been more shrewdly captured than in André Aciman's frank, unsentimental, heartrending elegy to human passion. Call Me by Your Name is clear-eyed, bare-knuckled, and ultimately unforgettable.",
      "reviews": ""
    },
    {
      "id": "7",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/7tippingthevelvet_myttg2.jpg",
      "title": "Tipping the Velvet",
      "author": "Sarah Waters",
      "published": "2000-05-01",
      "publisher": "Riverhead Books U.S.",
      "pages": 472,
      "description": "Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's dresser and the two head for the bright lights of Leicester Square where they begin a glittering career as music-hall stars in an all-singing and dancing double act. At the same time, behind closed doors, they admit their attraction to each other and their affair begins.",
      "reviews": ""
    },
    {
      "id": "8",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/8funhome_trb7bi.jpg",
      "title": "Fun Home: A Family Tragicomic",
      "author": "Alison Bechdel",
      "published": "2006-06-08",
      "publisher": "Houghton Mifflin Company",
      "pages": 240,
      "description": "Meet Alison's father, a historic preservation expert and obsessive restorer of the family's Victorian home, a third-generation funeral home director, a high school English teacher, an icily distant parent, and a closeted homosexual who, as it turns out, is involved with his male students and a family babysitter. Through narrative that is alternately heartbreaking and fiercely funny, we are drawn into a daughter's complex yearning for her father. And yet, apart from assigned stints dusting caskets at the family-owned \"fun home,\" as Alison and her brothers call it, the relationship achieves its most intimate expression through the shared code of books. When Alison comes out as homosexual herself in late adolescense, the denouement is swift, graphic -- and redemptive.",
      "reviews": ""
    },
    {
      "id": "9",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/9thesongofschilles_uebeqd.jpg",
      "title": "The Song of Achilles",
      "author": "Madeline Miller",
      "published": "2011-09-20",
      "publisher": "Bloomsbury Publishing",
      "pages": 352,
      "description": "Greece in the age of heroes. Patroclus, an awkward young prince, has been exiled to the court of King Peleus and his perfect son Achilles. By all rights their paths should never cross, but Achilles takes the shamed prince as his friend, and as they grow into young men skilled in the arts of war and medicine their bond blossoms into something deeper - despite the displeasure of Achilles' mother Thetis, a cruel sea goddess. But then word comes that Helen of Sparta has been kidnapped. Torn between love and fear for his friend, Patroclus journeys with Achilles to Troy, little knowing that the years that follow will test everything they hold dear.\n\nProfoundly moving and breathtakingly original, this rendering of the epic Trojan War is a dazzling feat of the imagination, a devastating love story, and an almighty battle between gods and kings, peace and glory, immortal fame and the human heart.",
      "reviews": ""
    },
    {
      "id": "10",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623447645/rainbowReads/10fingersmith_slh4jl.jpg",
      "title": "Fingersmith",
      "author": "Sarah Waters",
      "published": "2002-10-01",
      "publisher": "Riverhead Books",
      "pages": 592,
      "description": "Sue Trinder is an orphan, left as an infant in the care of Mrs. Sucksby, a \"baby farmer,\" who raised her with unusual tenderness, as if Sue were her own. Mrs. Sucksby’s household, with its fussy babies calmed with doses of gin, also hosts a transient family of petty thieves—fingersmiths—for whom this house in the heart of a mean London slum is home. One day, the most beloved thief of all arrives—Gentleman, an elegant con man, who carries with him an enticing proposition for Sue: If she wins a position as the maid to Maud Lilly, a naïve gentlewoman, and aids Gentleman in her seduction, then they will all share in Maud’s vast inheritance. Once the inheritance is secured, Maud will be disposed of—passed off as mad, and made to live out the rest of her days in a lunatic asylum. With dreams of paying back the kindness of her adopted family, Sue agrees to the plan. Once in, however, Sue begins to pity her helpless mark and care for Maud Lilly in unexpected ways...But no one and nothing is as it seems in this Dickensian novel of thrills and reversals.",
      "reviews": ""
    },
    {
      "id": "11",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/11theperks_c6yrqe.jpg",
      "title": "The Perks of Being A Wallflower",
      "author": "Stephen Chbosky",
      "published": "1999-02-01",
      "publisher": "MTV Books/Pocket Books",
      "pages": 213,
      "description": "standing on the fringes of life... offers a unique perspective. But there comes a time to see what it looks like from the dance floor. This haunting novel about the dilemma of passivity vs. passion marks the stunning debut of a provocative new voice in contemporary fiction: The Perks of Being A WALLFLOWER This is the story of what it's like to grow up in high school. More intimate than a diary, Charlie's letters are singular and unique, hilarious and devastating. We may not know where he lives. We may not know to whom he is writing. All we know is the world he shares. Caught between trying to live his life and trying to run from it puts him on a strange course through uncharted territory. The world of first dates and mixed tapes, family dramas and new friends. The world of sex, drugs, and The Rocky Horror Picture Show, when all one requires is that the perfect song on that perfect drive to feel infinite. Through Charlie, Stephen Chbosky has created a deeply affecting coming-of-age story, a powerful novel that will spirit you back to those wild and poignant roller coaster days known as growing up.",
      "reviews": ""
    },
    {
      "id": "12",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/12brokebackmountain_cg8ydk.jpg",
      "title": "Brokeback Mountain",
      "author": "Annie Proulx",
      "published": "2005-12-02",
      "publisher": "Scribner",
      "pages": 55,
      "description": "Annie Proulx has written some of the most original and brilliant short stories in contemporary literature, and for many readers and reviewers, \"Brokeback Mountain\" is her masterpiece. Ennis del Mar and Jack Twist, two ranch hands, come together when they're working as sheepherder and camp tender one summer on a range above the tree line. At first, sharing an isolated tent, the attraction is casual, inevitable, but something deeper catches them that summer. nBoth men work hard, marry, and have kids because that's what cowboys do. But over the course of many years and frequent separations this relationship becomes the most important thing in their lives, and they do anything they can to preserve it. The New Yorker won the National Magazine Award for Fiction for its publication of \"Brokeback Mountain,\" and the story was included in Prize Stories 1998: The O. Henry Awards. In gorgeous and haunting prose, Proulx limns the difficult, dangerous affair between two cowboys that survives everything but the world's violent intolerance.",
      "reviews": ""
    },
    {
      "id": "13",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/13thehours_kyihp1.jpg",
      "title": "The Hours",
      "author": "Michael Cunningham",
      "published": "2002-10",
      "publisher": "Picador USA",
      "pages": 230,
      "description": "In 1920s London, Virginia Woolf is fighting against her rebellious spirit as she attempts to make a start on her new novel. A young wife and mother, broiling in a suburb of 1940s Los Angeles, yearns to escape and read her precious copy of Mrs Dalloway. And Clarissa Vaughan steps out of her smart Greenwich village apartment in 1990s New York to buy flowers for a party she is hosting for a dying friend.\n\nThe Hours recasts the classic story of Woolf's Mrs Dalloway in a startling new light. Moving effortlessly across the decades and between England and America, this exquisite novel intertwines the worlds of three unforgettable women.",
      "reviews": ""
    },
    {
      "id": "14",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/14giovanni_gdj5m5.jpg",
      "title": "Giovanni's Room",
      "author": "James Baldwin",
      "published": "2000-06",
      "publisher": "Penguin",
      "pages": 170,
      "description": "Baldwin's haunting and controversial second novel is his most sustained treatment of sexuality, and a classic of gay literature. In a 1950s Paris swarming with expatriates and characterized by dangerous liaisons and hidden violence, an American finds himself unable to repress his impulses, despite his determination to live the conventional life he envisions for himself. After meeting and proposing to a young woman, he falls into a lengthy affair with an Italian bartender and is confounded and tortured by his sexual identity as he oscillates between the two.\n\nExamining the mystery of love and passion in an intensely imagined narrative, Baldwin creates a moving and complex story of death and desire that is revelatory in its insight.",
      "reviews": ""
    },
    {
      "id": "15",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/15friedgreen_nojgdt.jpg",
      "title": "Fried Green Tomatoes at the Whistle Stop Cafe",
      "author": "Fannie Flag",
      "published": "2002-05-07",
      "publisher": "Random House",
      "pages": 416,
      "description": "It's first the story of two women in the 1980s, of gray-headed Mrs. Threadgoode telling her life story to Evelyn, who is in the sad slump of middle age. The tale she tells is also of two women-of the irrepressibly daredevilish tomboy Idgie and her friend Ruth, who back in the thirties ran a little place in Whistle Stop, Alabama, a Southern kind of Cafe Wobegon offering good barbecue and good coffee and all kinds of love and laughter, even an occasional murder.",
      "reviews": ""
    },
    {
      "id": "16",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/16talesofthecity_qwt2oc.jpg",
      "title": "Tales of The City",
      "author": "Armistead Maupin",
      "published": "1989",
      "publisher": "Black Swan",
      "pages": 272,
      "description": "San Francisco, 1976. A naïve young secretary, fresh out of Cleveland, tumbles headlong into a brave new world of laundromat Lotharios, pot-growing landladies, cut throat debutantes, and Jockey Shorts dance contests. The saga that ensues is manic, romantic, tawdry, touching, and outrageous—unmistakably the handiwork of Armistead Maupin.",
      "reviews": ""
    },
    {
      "id": "17",
      "imageUrl": "hhttps://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/17oranges_wvzh64.jpg",
      "title": "Oranges Are Not the Only Fruit",
      "author": "Jeanette Winterson",
      "published": "1997-08-20",
      "publisher": "Grove Press",
      "pages": 176,
      "description": "This is the story of Jeanette, adopted and brought up by her mother as one of God's elect. Zealous and passionate, she seems destined for life as a missionary, but then she falls for one of her converts.\n\nAt sixteen, Jeanette decides to leave the church, her home and her family, for the young woman she loves. Innovative, punchy and tender, Oranges Are Not the Only Fruit is a few days ride into the bizarre outposts of religious excess and human obsession.",
      "reviews": ""
    },
    {
      "id": "18",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/18simonvs_n3p0u2.jpg",
      "title": "Simon vs. the Homo Sapiens Agenda",
      "author": "Becky Albertalli, Mathilde Tamae-Bouhon",
      "published": "2015-04-07",
      "publisher": "Balzer + Bray",
      "pages": 303,
      "description": "Sixteen-year-old and not-so-openly gay Simon Spier prefers to save his drama for the school musical. But when an email falls into the wrong hands, his secret is at risk of being thrust into the spotlight. Now Simon is actually being blackmailed: if he doesn’t play wingman for class clown Martin, his sexual identity will become everyone’s business. Worse, the privacy of Blue, the pen name of the boy he’s been emailing, will be compromised.\n\nWith some messy dynamics emerging in his once tight-knit group of friends, and his email correspondence with Blue growing more flirtatious every day, Simon’s junior year has suddenly gotten all kinds of complicated. Now, change-averse Simon has to find a way to step out of his comfort zone before he’s pushed out—without alienating his friends, compromising himself, or fumbling a shot at happiness with the most confusing, adorable guy he’s never met.",
      "reviews": ""
    },
    {
      "id": "19",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/19carol_cm9cug.jpg",
      "title": "Carol",
      "author": "Claire Morgan (Pseudonym), Patricia Highsmith",
      "published": "2015-11-09",
      "publisher": "W. W. Norton Company",
      "pages": 304,
      "description": "Patricia Highsmith's story of romantic obsession may be one of the most important, but still largely unrecognized, novels of the twentieth century. First published in 1952 and touted as \"the novel of a love that society forbids,\" the book soon became a cult classic. Based on a true story plucked from Highsmith's own life, Carol tells the riveting drama of Therese Belivet, a stage designer trapped in a department-store day job, whose routine is forever shattered by a gorgeous epiphany—the appearance of Carol Aird, a customer who comes in to buy her daughter a Christmas toy. Therese begins to gravitate toward the alluring suburban housewife, who is trapped in a marriage as stultifying as Therese's job. They fall in love and set out across the United States, ensnared by society's confines and the imminent disapproval of others, yet propelled by their infatuation. Carol is a brilliantly written story that may surprise Highsmith fans and will delight those discovering her work. This authorized edition includes an afterword by Patricia Highsmith. Previously titled The Price of Salt.",
      "reviews": ""
    },
    {
      "id": "20",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/20carryon_uuogvx.jpg",
      "title": "Carry On",
      "author": "Rainbow Rowell",
      "published": "2017-05-09",
      "publisher": "Wednesday Books",
      "pages": 522,
      "description": "Simon Snow is the worst Chosen One who's ever been chosen.\n\nThat's what his roommate, Baz, says. And Baz might be evil and a vampire and a complete git, but he's probably right.\n\nHalf the time, Simon can't even make his wand work, and the other half, he starts something on fire. His mentor's avoiding him, his girlfriend broke up with him, and there's a magic-eating monster running around, wearing Simon's face. Baz would be having a field day with all this, if he were here — it's their last year at the Watford School of Magicks, and Simon's infuriating nemesis didn't even bother to show up.",
      "reviews": ""
    },
    {
      "id": "21",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/21stonebutch_vyukf5.jpg",
      "title": "Stone Butch Blues",
      "author": "Leslie Feinberg",
      "published": "2003-11",
      "publisher": "Alyson Books",
      "pages": 308,
      "description": "Woman or man? This internationally acclaimed novel looks at the world through the eyes of Jess Goldberg, a masculine girl growing up in the \"Ozzie and Harriet\" McCarthy era and coming out as a young butch lesbian in the pre-Stonewall gay drag bars of a blue-collar town. Stone Butch Blues traces a propulsive journey, powerfully evoking history and politics while portraying an extraordinary protagonist full of longing, vulnerability, and working-class grit. This once-underground classic takes the reader on a roller-coaster ride of gender transformation and exploration and ultimately speaks to the heart of anyone who has ever suffered or gloried in being different.",
      "reviews": ""
    },
    {
      "id": "22",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/22asingleman_ox4okl.jpg",
      "title": "A Single Man",
      "author": "Christopher Isherwood",
      "published": "2001-03-20",
      "publisher": "Univ Of Minnesota Press",
      "pages": 192,
      "description": "\"When A Single Man was originally published, it shocked many by its frank, sympathetic, and moving portrayal of a gay man in midlife. George, the protagonist, is adjusting to life on his own after the sudden death of his partner, determined to persist in the routines of his daily life. An Englishman and a professor living in suburban Southern California, he is an outsider in every way, and his internal reflections and interactions with others reveal a man who loves being alive despite everyday injustices and loneliness. Wry, suddenly manic, constantly funny, surprisingly sad, this novel catches the true textures of life itself.\"--BOOK JACKET.",
      "reviews": ""
    },
    {
      "id": "23",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/23orlando_rv9ffk.jpg",
      "title": "Orlando",
      "author": "Virginia Woolf",
      "published": "2000-09-28",
      "publisher": "Penguin Classics",
      "pages": 272,
      "description": "Virginia Woolf's Orlando 'The longest and most charming love letter in literature', playfully constructs the figure of Orlando as the fictional embodiment of Woolf's close friend and lover, Vita Sackville-West. Spanning three centuries, the novel opens as Orlando, a young nobleman in Elizabeth's England, awaits a visit from the Queen and traces his experience with first love as England under James I lies locked in the embrace of the Great Frost. At the midpoint of the novel, Orlando, now an ambassador in Constantinople, awakes to find that he is now a woman, and the novel indulges in farce and irony to consider the roles of women in the 18th and 19th centuries. As the novel ends in 1928, a year consonant with full suffrage for women. Orlando, now a wife and mother, stands poised at the brink of a future that holds new hope and promise for women.",
      "reviews": ""
    },
    {
      "id": "24",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/24atswim_cb6y6b.jpg",
      "title": "At Swim, Two Boys",
      "author": "Jamie O'Neill",
      "published": "2003-03-04",
      "publisher": "Scribner",
      "pages": 562,
      "description": "Praised as “a work of wild, vaulting ambition and achievement” by Entertainment Weekly, Jamie O’Neill’s first novel invites comparison to such literary greats as James Joyce, Samuel Beckett and Charles Dickens. Set during the year preceding the Easter Uprising of 1916—Ireland’s brave but fractured revolt against British rule—At Swim, Two Boys is a tender, tragic love story and a brilliant depiction of people caught in the tide of history. Powerful and artful, and ten years in the writing, it is a masterwork from Jamie O’Neill. Jim Mack is a naïve young scholar and the son of a foolish, aspiring shopkeeper. Doyler Doyle is the rough-diamond son—revolutionary and blasphemous—of Mr. Mack’s old army pal. Out at the Forty Foot, that great jut of rock where gentlemen bathe in the nude, the two boys make a pact: Doyler will teach Jim to swim, and in a year, on Easter of 1916, they will swim to the distant beacon of Muglins Rock and claim that island for themselves. All the while Mr. Mack, who has grand plans for a corner shop empire, remains unaware of the depth of the boys’ burgeoning friendship and of the changing landscape of a nation.",
      "reviews": ""
    },
    {
      "id": "25",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/25runningwithscissors_t2ilkk.jpg",
      "title": "Running With Scissors",
      "author": "Augusten Burroughs",
      "published": "2003-06-01",
      "publisher": "Picador USA",
      "pages": 304,
      "description": "Running with Scissors is the true story of a boy whose mother (a poet with delusions of Anne Sexton) gave him away to be raised by her unorthodox psychiatrist who bore a striking resemblance to Santa Claus. So at the age of twelve, Burroughs found himself amidst Victorian squalor living with the doctor’s bizarre family, and befriending a pedophile who resided in the backyard shed. The story of an outlaw childhood where rules were unheard of, and the Christmas tree stayed up all year round, where Valium was consumed like candy, and if things got dull an electroshock- therapy machine could provide entertainment. The funny, harrowing and bestselling account of an ordinary boy’s survival under the most extraordinary circumstances.",
      "reviews": ""
    },
    {
      "id": "26",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/26rubyfruit_s67l3j.jpg",
      "title": "Rubyfruit Jungle",
      "author": "Rita Mae Brown",
      "published": "1980-10",
      "publisher": "Bantam",
      "pages": 246,
      "description": "Bawdy and moving, the ultimate word-of-mouth bestseller, Rubyfruit Jungle is about growing up a lesbian in America--and living happily ever after.",
      "reviews": ""
    },
    {
      "id": "27",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528581/rainbowReads/27ahome_metn2g.jpg",
      "title": "A Home at the End of the World",
      "author": "Michael Cunningham",
      "published": "2004-07-01",
      "publisher": "Picador",
      "pages": 342,
      "description": "Michael Cunningham’s celebrated novel is the story of two boyhood friends: Jonathan, lonely, introspective, and unsure of himself; and Bobby, hip, dark, and inarticulate. In New York after college, Bobby moves in with Jonathan and his roommate, Clare, a veteran of the city's erotic wars. Bobby and Clare fall in love, scuttling the plans of Jonathan, who is gay, to father Clare's child. Then, when Clare and Bobby have a baby, the three move to a small house upstate to raise \"their\" child together and, with an odd friend, Alice, create a new kind of family. A Home at the End of the World masterfully depicts the charged, fragile relationships of urban life today.",
      "reviews": ""
    },
    {
      "id": "28",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/28metalkpretty_pc7zo8.jpg",
      "title": "Me Talk Prety One Day",
      "author": "David Sedaris",
      "published": "2001",
      "publisher": "Little, Brown and Company",
      "pages": 272,
      "description": "David Sedaris' move to Paris from New York inspired these hilarious pieces, including the title essay, about his attempts to learn French from a sadistic teacher who declares that every day spent with you is like having a caesarean section. His family is another inspiration. You Can't Kill the Rooster is a portrait of his brother, who talks incessant hip-hop slang to his bewildered father. And no one hones a finer fury in response to such modern annoyances as restaurant meals presented in ludicrous towers of food and cashiers with six-inch fingernails.",
      "reviews": ""
    },
    {
      "id": "29",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/29mrsdalloway_s7d6x1.jpg",
      "title": "Mrs. Dalloway",
      "author": "Virginia Woolf",
      "published": "2002-10-28",
      "publisher": "Houghton Mifflin Harcourt",
      "pages": 194,
      "description": "Heralded as Virginia Woolf's greatest novel, this is a vivid portrait of a single day in a woman's life. When we meet her, Mrs. Clarissa Dalloway is preoccupied with the last-minute details of party preparation while in her mind she is something much more than a perfect society hostess. As she readies her house, she is flooded with remembrances of faraway times. And, met with the realities of the present, Clarissa reexamines the choices that brought her there, hesitantly looking ahead to the unfamiliar work of growing old.",
      "reviews": ""
    },
    {
      "id": "30",
      "imageUrl": "https://res.cloudinary.com/tonetsang/image/upload/v1623528582/rainbowReads/30willgrayson_i16apl.jpg",
      "title": "Will Grayson, Will Grayson",
      "author": "John Green, David Levithan",
      "published": "2010-04-06",
      "publisher": "Dutton Books",
      "pages": 310,
      "description": "Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.\n\nIt's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the same surprising crossroads, the Will Graysons find their lives overlapping and hurtling in new and unexpected directions. With a push from friends new and old - including the massive, and massively fabulous, Tiny Cooper, offensive lineman and musical theater auteur extraordinaire - Will and Will begin building toward respective romantic turns-of-heart and the epic production of history's most awesome high school musical.",
      "reviews": ""
    }
]
